'use client'

import React, {Dispatch, SetStateAction} from "react";
import {useAnnoncuments} from "@@/store/useAnnouncement";
import Image from "next/image";
import {AiFillEdit, AiOutlineClose} from "react-icons/ai";
import { StaticImport } from "next/dist/shared/lib/get-img-props";

type ContainerProps = {
    onClose: Dispatch<SetStateAction<boolean>>;
};
const View: React.FunctionComponent<ContainerProps> = ({onClose}) => {

    const {announcements} = useAnnoncuments(state => state.annoncuments)


    const [photoProduct, setPhotoProduct] = React.useState(announcements.images[0])

    // @ts-ignore
    return (
        <>
            <div className={"p-5 flex justify-between flex-col h-full "}>
                <h1 className={"text-3xl text-center font-bold p-4"}>{announcements.name}</h1>
                <div className={"flex  w-full h-full p-4"}>
                    <div className={"flex items-start h-full"}>
                        <div className={"announ_img grid grid-cols-1 gap-3 px-6 h-[60vh]"}>
                            {announcements.images.map((item: string | StaticImport, index:number) =>
                                <Image
                                    key={index}
                                    onClick={() => setPhotoProduct(item)}
                                    className={"rounded-2xl"}
                                    src={item}
                                    alt={announcements.name}
                                    width={100}
                                    height={100}

                                />)}
                        </div>
                    </div>
                    <div className={" w-full  flex"}>
                        <div className={"h-[50vh] w-[400px] px-6 mr-6  relative"}>
                            <Image className={"rounded-2xl "} src={photoProduct} alt={announcements.name} fill/>
                        </div>
                        <div className={"w-full border h-full overflow-y-scroll mb-16"}>
                            <p className={"p-4"}>Далеко-далеко за словесными горами в стране гласных и согласных живут
                                рыбные тексты. То первую власти обеспечивает! Осталось жаренные использовало толку lorem
                                маленький вопроса агентство несколько рыбного пустился. Агентство залетают, пояс
                                проектах взобравшись собрал текста образ путь знаках одна коварных пор предложения
                                последний они свою которой предупреждал речью скатился, рыбными моей даль. Собрал города
                                языкового точках заманивший обеспечивает рукопись прямо агентство запятых букв но?
                                Обеспечивает семантика путь себя безорфографичный безопасную пояс строчка города от всех
                                бросил по всей. Взгляд оксмокс знаках подзаголовок деревни ты взобравшись проектах
                                рукописи дал, города текст залетают рыбного строчка, над семь свой собрал за языком
                                власти? Она то это, взгляд возвращайся заманивший своего жизни оксмокс рот, гор lorem,
                                ему большой скатился которой что текстов семь. Сих ему предупредила на берегу переулка,
                                подпоясал страна однажды его моей щеке своих вопрос переписывается города она грамматики
                                продолжил свой? Путь деревни он пояс взобравшись? Единственное текстов последний города
                                составитель силуэт lorem, меня приставка переписали оксмокс заманивший вопроса жизни
                                путь дал послушавшись имеет агентство продолжил, на берегу эта не, которое над диких
                                своих. Пор текстами обеспечивает заманивший сбить путь переулка рукопись ее моей
                                буквоград? Составитель, заголовок? Рекламных не это толку наш пояс единственное! Раз
                                подзаголовок деревни оксмокс вопроса что пор пунктуация безопасную толку заманивший путь
                                рекламных языком, обеспечивает речью даль рукописи пустился ты имеет своего океана даже
                                над дал! Пунктуация рот скатился свой путь? Раз журчит дал текстов рукописи это
                                реторический ручеек, до агентство свой бросил, повстречался последний семь то океана
                                послушавшись запятых сбить предложения за путь точках о злых. Предложения толку прямо
                                щеке! Переписали сбить пор живет вдали послушавшись lorem рукописи, то путь образ дал
                                грамматики, языком заглавных что залетают букв рекламных они маленькая выйти, о родного
                                города. Правилами диких там домах послушавшись наш, которой раз необходимыми до если
                                семантика пояс большого, дорогу текста страну одна проектах! Курсивных которое океана
                                толку то. Образ необходимыми его ipsum страна своих, свой страну деревни ему. Текста
                                жаренные маленький речью безорфографичный составитель это пунктуация всеми сих
                                подзаголовок продолжил то, рыбными всемогущая буквенных языком путь города букв,
                                грустный океана послушавшись, своего текст назад грамматики правилами щеке. Инициал
                                вдали деревни по всей ее жизни однажды правилами путь точках даже океана дорогу строчка,
                                текстами свой текст имени, его речью несколько ручеек грустный последний послушавшись.
                                Рукопись не лучше родного несколько прямо решила, снова страна алфавит. Домах маленькая
                                текстов, возвращайся имеет эта, на берегу парадигматическая предложения дорогу рукописи
                                своего пунктуация заглавных, журчит напоивший страну пор силуэт снова буквоград языком
                                даже переулка но подзаголовок путь. Свою грамматики использовало языкового страна
                                заглавных назад на берегу своих домах он, деревни власти они дал букв лучше о заманивший
                                бросил города, текста родного всеми свое пунктуация предупредила рыбного? Ведущими
                                вопроса наш города букв страна от всех взобравшись страну мир путь обеспечивает. Не
                                своих подзаголовок свое, путь рукописи, если мир то одна вопроса продолжил грустный
                                ручеек прямо щеке имеет ее бросил журчит ipsum всеми повстречался сих речью что точках.
                                Курсивных над буквоград пор страна своего, продолжил точках, даже раз на берегу
                                переписали дороге он себя свой по всей но сбить решила? Она родного осталось предложения
                                пояс коварных вершину щеке агентство по всей, вдали власти подзаголовок грустный
                                несколько собрал журчит. Над снова грустный пор первую буквоград текстами пояс гор, злых
                                языком коварный рукописи прямо семантика большой власти обеспечивает маленькая
                                безорфографичный вершину деревни всемогущая. Своих даль толку свой возвращайся они выйти
                                она безопасную ты ведущими. Переписывается силуэт большой маленький точках рукопись
                                ведущими рекламных подзаголовок жизни они имени! Первую, рыбными все страну щеке себя
                                имени запятой города даль повстречался коварный грустный, раз своего страна собрал
                                семантика текстов составитель выйти пояс его прямо запятых необходимыми жизни
                                предупреждал жаренные! Жизни, свой все раз путь реторический бросил выйти? Языкового
                                пунктуация прямо снова, по всей взгляд, букв текст они напоивший рот наш заглавных
                                страна жизни там меня его точках домах большого журчит семантика буквоград. Оксмокс мир
                                большого, скатился от всех бросил коварный журчит буквоград если всемогущая своего но
                                реторический о снова предложения ручеек его страна одна рот алфавит там. Великий
                                большой, дорогу залетают, маленькая путь своих до щеке напоивший единственное заглавных
                                несколько рекламных агентство грамматики парадигматическая большого! Собрал, своих над
                                рыбного взобравшись наш рукописи власти выйти даже что маленькая от всех лучше свой
                                запятой грамматики переулка подпоясал текстов семантика продолжил о пор гор прямо за
                                переписали. Бросил семь дорогу залетают. Снова переулка за текста на берегу букв свою от
                                всех эта возвращайся единственное себя одна злых, приставка маленькая! Алфавит наш путь
                                подзаголовок знаках языкового использовало вершину коварный власти букв живет грамматики
                                осталось города маленький рыбными, большого меня текстов вскоре первую пунктуация
                                рыбного своего. О безорфографичный назад наш раз реторический от всех он, если
                                правилами, живет языком мир имени жизни власти его скатился до моей инициал ipsum своих
                                залетают встретил рукопись ее! Оксмокс собрал подзаголовок образ встретил которой
                                агентство страна рукопись переписывается использовало. Маленький, страну она! Его,
                                безопасную пор. Знаках составитель курсивных текста букв мир продолжил путь сих своего
                                страна которое, за парадигматическая предложения ему строчка рукопись? Ее что текстами
                                дороге щеке проектах большого рыбного вершину пунктуация свой, то, ручеек это путь
                                предложения силуэт, подзаголовок знаках большой реторический предупреждал ведущими
                                переписывается сбить? Журчит она коварный грустный мир толку речью коварных сбить
                                великий образ пор использовало что одна пустился пунктуация языком первую домах,
                                несколько семантика своих обеспечивает безорфографичный они это, себя моей. Реторический
                                снова путь сих лучше подпоясал назад? Переулка ipsum проектах прямо, пустился, если
                                напоивший переписывается наш, рукопись города текста рыбного своих свой языкового. Если
                                буквенных переулка текстов вдали знаках реторический рыбными! Сбить дал океана семь
                                которой повстречался вдали но, рыбными свое языкового дорогу приставка безорфографичный
                                буквоград вскоре всеми необходимыми знаках, взгляд рыбного все прямо грамматики они
                                ручеек пор. Повстречался, путь обеспечивает не меня заманивший запятой продолжил вскоре
                                агентство назад она безопасную знаках предложения приставка. До снова страну если
                                рукопись мир бросил дал буквенных что продолжил образ точках встретил от всех свою
                                напоивший запятой свой заманивший имеет рыбными она большого, алфавит жизни которой
                                города языком! Свою своих осталось всемогущая вскоре послушавшись курсивных живет
                                маленькая рукопись, обеспечивает точках безорфографичный пор однажды дал маленький
                                залетают lorem буквоград щеке она взгляд. Пунктуация большой маленький моей жизни знаках
                                но строчка гор осталось щеке! Они толку лучше своего дорогу вопрос это она проектах
                                строчка инициал буквоград вершину, всемогущая агентство страну домах языкового
                                использовало? То пояс над, по всей о осталось выйти маленький заголовок, продолжил
                                правилами эта, переписывается мир ему деревни залетают назад! Если пустился вопрос
                                обеспечивает lorem! Ведущими, парадигматическая ее там оксмокс власти первую буквенных
                                lorem то? Вдали вопроса заголовок оксмокс осталось гор подзаголовок переулка,
                                возвращайся переписали однажды коварный дал парадигматическая наш ipsum вопрос дорогу
                                необходимыми, своего океана. Проектах осталось, семантика деревни оксмокс
                                безорфографичный знаках жизни то lorem рукописи, агентство своих? Проектах алфавит снова
                                рекламных своего которой повстречался текста пустился пунктуация родного вдали рукопись
                                несколько безопасную, образ вопрос? Выйти последний даль великий гор текста проектах
                                ipsum единственное? Послушавшись вопрос инициал запятых рекламных толку силуэт выйти
                                назад меня путь! Оксмокс, агентство. Бросил страну образ напоивший города проектах?
                                Текст большого раз, свой свое скатился свою, все использовало ее страну ему своего там
                                переписали встретил бросил эта. Он возвращайся языком продолжил, не ipsum переписали
                                единственное буквенных путь о ты алфавит агентство города переписывается власти
                                маленькая. Строчка большого парадигматическая что прямо одна города, свое инициал страна
                                послушавшись там на берегу, большой, курсивных переписывается проектах образ? Все вопрос
                                предупредила знаках о необходимыми вскоре агентство по всей. Агентство страна последний,
                                себя она составитель, рукописи по всей коварный встретил которое использовало журчит
                                прямо залетают великий оксмокс. Журчит снова пояс проектах предупреждал продолжил моей,
                                ведущими послушавшись буквенных великий назад деревни, безорфографичный вершину даль
                                осталось знаках страна он она семь города пунктуация курсивных рекламных? Пунктуация он
                                вскоре пояс жизни составитель сбить осталось заголовок всемогущая, парадигматическая,
                                назад города снова правилами подпоясал. Путь залетают переписывается подпоясал правилами
                                реторический языком инициал жаренные заманивший там меня, вопрос свой снова запятой,
                                страну приставка, грустный заголовок выйти даже по всей толку грамматики. Переписали
                                осталось, встретил однажды речью текстами от всех возвращайся путь бросил свой большого
                                заголовок пустился они. Своих решила заголовок даже наш от всех мир послушавшись?
                                Продолжил по всей свой своих даже о имени маленькая, буквенных, необходимыми ему
                                обеспечивает свое безорфографичный взобравшись. Она даль что однажды. Скатился рыбного
                                моей наш подзаголовок собрал себя, знаках ручеек языкового парадигматическая ты, раз
                                если запятых диких это всеми оксмокс журчит реторический переулка свой подпоясал
                                переписали! Продолжил, единственное своих правилами вдали живет свою строчка моей
                                пустился буквоград там букв взгляд подзаголовок первую текст но образ путь переписали
                                предложения рот всемогущая вопроса океана буквенных. Переписывается сбить свою языком
                                своих вопроса, дорогу вскоре оксмокс. Вдали бросил свое правилами предупредила, большого
                                грустный. Буквенных текстами обеспечивает все предупреждал, приставка lorem своих себя
                                взобравшись собрал даже грамматики, прямо взгляд коварный о рукописи, текстов
                                послушавшись за города по всей. Большой использовало, большого дороге возвращайся
                                вопроса однажды путь предложения подпоясал своих силуэт. Своих собрал продолжил алфавит.
                                Диких но приставка рыбными пор, себя путь грустный запятых, ее жаренные рыбного
                                рекламных, коварный знаках пустился первую курсивных подпоясал предложения текстов там
                                до взгляд ipsum подзаголовок заголовок правилами. Использовало рекламных себя взгляд
                                lorem, инициал необходимыми несколько буквенных алфавит, гор сбить приставка имеет,
                                подзаголовок предупреждал буквоград большого ему грамматики дороге живет толку от всех
                                жаренные подпоясал пунктуация языкового? Даже семантика власти меня семь грамматики о,
                                инициал журчит коварный. Подзаголовок путь составитель речью курсивных снова
                                необходимыми на берегу обеспечивает мир? Живет мир напоивший деревни? Они, взгляд ipsum
                                предложения вопрос которое жаренные живет свой прямо назад что. Дороге переписывается
                                всемогущая образ диких, рыбного возвращайся если, на берегу вскоре вершину себя
                                заголовок все напоивший точках назад злых последний составитель всеми? Рукопись там
                                обеспечивает если ручеек, запятой последний сбить всемогущая инициал безорфографичный
                                великий страна возвращайся пустился гор предупреждал ее агентство диких вдали грустный
                                решила свой заглавных пор переулка. Строчка правилами родного продолжил пояс! Дал своего
                                однажды путь от всех оксмокс это несколько рыбного! Гор предупредила имеет свое
                                семантика вскоре скатился образ, но курсивных одна? Путь, парадигматическая, заголовок
                                речью до оксмокс то, города ведущими залетают это толку повстречался о маленький от всех
                                рот щеке семантика рекламных. Вскоре продолжил, страна путь, текстов своего по всей
                                текста города сбить которой составитель за диких однажды семь последний о назад
                                подзаголовок правилами мир даже толку рукопись! Знаках за дал однажды великий, бросил
                                безорфографичный назад подзаголовок. Подзаголовок алфавит страна своих первую пунктуация
                                на берегу деревни правилами не пояс, назад залетают ручеек заманивший заголовок
                                безорфографичный свое однажды ему послушавшись. Семь продолжил родного путь курсивных
                                вершину он свою переписывается даже, это последний грустный рыбного подпоясал переулка
                                запятой маленькая необходимыми? Переписывается, снова возвращайся? Что жизни грустный
                                речью повстречался. Щеке предупредила они безорфографичный. Толку встретил его
                                реторический которое страну ipsum океана о проектах взгляд, свое пояс то бросил! Силуэт
                                свой знаках парадигматическая наш необходимыми, предложения вершину предупреждал букв,
                                пустился курсивных буквенных, дороге о власти своего ему? Свое свой своего, прямо, жизни
                                моей живет ipsum, оксмокс запятых на берегу дорогу которое заголовок ее последний
                                продолжил взобравшись что. Мир меня, рукописи деревни океана точках строчка запятой
                                безорфографичный пояс запятых заманивший семь lorem там текстами буквенных грамматики
                                взобравшись вершину. Lorem злых, заглавных силуэт моей взобравшись скатился о
                                составитель рукописи своих осталось власти, снова, ты назад алфавит ему но предложения
                                свою дал своего? Речью своего заглавных жизни образ повстречался, подзаголовок злых
                                курсивных большой возвращайся путь, рыбного но, единственное пустился текст. Диких,
                                семантика там инициал, переулка маленький продолжил текстами все единственное взгляд
                                языком, снова домах. Имеет, семантика? Над вопроса домах вскоре переписали, толку первую
                                бросил подзаголовок. Выйти рыбного не всемогущая рукописи заглавных, о встретил взгляд
                                страну власти дороге большой снова сбить она деревни запятых вдали имени своего по всей
                                текста агентство вопроса даль вскоре. Ты, однажды рыбными раз пор точках великий.
                                Однажды безорфографичный, агентство парадигматическая его живет запятой алфавит вдали
                                которой ручеек пор, осталось точках собрал имени маленький жаренные снова рекламных
                                встретил всеми. Составитель послушавшись свое большого безорфографичный, вдали что
                                единственное живет парадигматическая языком имени эта! Продолжил напоивший выйти она о
                                буквенных точках, своего несколько, лучше, правилами страна пунктуация от всех. Все
                                собрал своих всеми над своего маленькая дороге текстов снова предупреждал оксмокс даль
                                ты ему заманивший даже вершину если, использовало живет на берегу вопроса домах
                                рукопись. Текста путь лучше вопроса своих ipsum ему, по всей, она курсивных знаках
                                своего рыбными прямо текстов безопасную не большого свой, грамматики великий вопрос?
                                Залетают страну это рекламных вопроса большого бросил до по всей от всех то заглавных
                                ipsum запятых запятой за большой, текста семь домах, не переписывается! По всей собрал
                                вопрос запятой свою, вскоре, ручеек сбить агентство своего предупредила заголовок
                                рекламных если вершину. Маленький, образ. Рот переулка лучше, продолжил ему дорогу она
                                пояс то диких они там даль журчит, текст великий, правилами парадигматическая буквоград
                                инициал дороге.</p>
                        </div>
                    </div>
                </div>

            </div>
            <div className={"flex gap-3 justify-end fixed left-0 bottom-0 p-4 px-10 w-full bg-white drop-shadow-xl"}>
                <button onClick={() => onClose(false)}
                        className={"p-4 w-[200px] rounded-xl flex items-center justify-center gap-6 bg-red-500 text-white font-bold"}> <AiOutlineClose className={"text-2xl"}/> Close
                </button>
                <button className={"p-4 w-[200px] rounded-xl flex items-center justify-center gap-6 bg-green-500 text-white font-bold"}><AiFillEdit className={"text-2xl"}/>   Edit</button>
            </div>
        </>
    )
}

export default View